
#include <iostream>
using namespace std;


int main()
{

    /*Завдання N1
    1. Дана діагональ телевізора в дюймах. Написати програму,
    що визначає цю ж діагональ у сантиметрах (1 дюйм =
    2.54 сантиметрів).*/

    //float diagonal_inch;
    //cout << "Enter TV diagonal in inches: ";
    //cin >> diagonal_inch;
    //const float inch_to_cm = 2.54;
    //float diagonal_cm = diagonal_inch * inch_to_cm;
    //cout << "Diagonal in cm = " << diagonal_cm << endl;


    /*Завдання N2
    За один день хом'ячок з'їдає K грам корму. Написати
    програму, що визначає закупівлю корму в кілограмах
    на 30 днів.*/

 //   float k;
	//cout << "Enter hamsters day food norm in grams: ";
 //   cin >> k;
 //   const int days = 30;
 //   const int grams_in_kg = 1000;
	//float food_kg = k * days / grams_in_kg;
	//cout << "Food for 30 days in kg = " << food_kg << endl;



    /*Завдання N3
    1.Введіть три числа і виведіть на екран їх значення та значення суми цих чисел.*/

 //   float number1, number2, number3;
	//cout << "Enter 3 numbers: ";
	//cin >> number1 >> number2 >> number3;
	//cout << "number1 = " << number1 << "\nnumber2 = " << number2 << "\nnumber3 = " << number3 << endl;
	//cout << "Sum = " << number1 + number2 + number3 << endl;
	

    /*Завдання N4
    2.Напишіть програму, яка обраховує середнє арифметичне двох чисел.*/

	//float number1, number2;
	//cout << "Enter 2 numbers: ";
	//cin >> number1 >> number2;
	//float average = (number1 + number2) / 2;
	//cout << "Average = " << average << endl;


    /*Завдання N5
    3.Напишіть програму, яка переводить кілометри в метри. Кілометри вводяться з клавіатури.*/

	//float disatance_km;
	//cout << "Enter distance in km: ";
	//cin >> disatance_km;
 //   const int km_to_m = 1000;
	//float distance_m = disatance_km * km_to_m;
	//cout << "Distance in m = " << distance_m << endl;
	
	
    /*Завдання N6
    4.Ви купили в магазині 4 різні товари. Дані ціни кожного товару (константні значення) та кількість товару, який був придбаний. Обрахувати та вивести вартість покупки.*/

	//float price1, price2, price3, price4;
	//int quantity1, quantity2, quantity3, quantity4;
	//cout << "Enter price and quantitie of the 1 product: ";
	//cin >> price1 >> quantity1;
	//cout << "Enter price and quantitie of the 2 product: ";
	//cin >> price2 >> quantity2;
	//cout << "Enter price and quantitie of the 3 product: ";
	//cin >> price3 >> quantity3;
	//cout << "Enter price and quantitie of the 4 product: ";
	//cin >> price4 >> quantity4;
	//float total_price = price1 * quantity1 + price2 * quantity2 + price3 * quantity3 + price4 * quantity4;
	//cout << "Total price = " << total_price << endl;
	

	/*Завдання N7
	5.Напишіть програму, яка обраховує квадрат довільного введеного числа*/

	//float number;
	//cout << "Enter number: ";
	//cin >> number;
	//float square_number = number * number;
	//cout << "Square of the number = " << square_number << endl;
	


	/*Завдання N8
	6.Написати програму, яка переводить дні в хвилини. Дні вводяться з клавіатури. Використати хоч би одну константу!!!*/

	//int days;
	//cout << "Enter days: ";
	//cin >> days;
	//const int hours_in_day = 24;
	//const int minutes_in_hour = 60;
	//int minutes = days * hours_in_day * minutes_in_hour;
	//cout << "Minutes in days = " << minutes << endl;
	









































}


